<template>
	<view class="protocol_page">
		<z-nav-bar title="协议"></z-nav-bar>
		<!-- 公共组件-每个页面必须引入 -->
		<public-module></public-module>
		<view class="title">{{title}}</view>
		<view></view>
		<jyf-parser ref="article"></jyf-parser>
		<view>
			
			“他她蜜”数字健康服务平台(简称“他她蜜”)是由他她蜜（海南）科技有限公司(简称他她蜜公司)自主研发并负责运营，包含电脑软件、手机应用平台、云端数据中心、配套运程智能监测设备等各组成部分。平台各项产品、服务的所有权、知识产权和运营权等全部权力归他她蜜公司所有。可实现用户自我身体指标监测、健康管理、医生远程慢病管理与健康指导，健康专业人员与大众用户即时沟通等功能。
			
			本协议是大众用户与“他她蜜”平台所有者“他她蜜公司”之间就“他她蜜”平台等产品、服务的相关事宜所签订的协议，点击同意协议并注册成功后，本协议即构成对双方有约束力的法律文件。</view></br>
			
		<view>一、注册和登录</view></br>
			
		<view>1. 用户点击同意本协议的即视为用户确认自己具有享受“他她蜜平台服务、付费等相应的权利能力和行为能力能够独立承担法律责任。(18周岁以下及其他限制行为能力人，需在父母或监护人的监护参与下才能使用“他她蜜”平台)。</view></br>
			
		<view>2. 用户同意注册协议条款、完成注册程序后，系统将为用户生成相应的“他她蜜”用户号码，成为平台的正式用户。用户应保证其提供的注册资料真实、准确、完整、合法有效，用户的 注册资料如发生变动，应及时更新。如果用户提供的注册资料不合法、不真实、不准确或者不详尽的用户需承担因此引起的相应责任及后果。“他她蜜”有权终止用户使用平台提供的各项服务。</view></br>
			
		<view>	3. 用户注册成功后，应妥善保存用户名、用户号码和密码等相关信息，若因用户自身的原因将用户名、用户号码和密码等相关信息丢失或者将相关信息转借他人使用由此造成的一切损失和后果，由用户自行承担。</view></br>
			
		<view>	4. 用户登录“他她蜜”平台享受服务，以下设备购置等相关费用需自行承担:</view>
			
		<view>	(1) 监测设备:包括血糖仪、血压计、智能腕表等;</view>
			
		<view>	(2) 上网设备:包括手机、电脑或其他上网终端、调制解调器及其他必备的上网装置;</view>
			
		<view>	(3) 上网开支:包括网络接入、上网设备租用、手机流量等费用。</view></br>
			
		<view>	二、权利与义务</view></br>
			
		<view>	1. 用户可通过“他她蜜”平台浏览和管理自己包括监测数据在内的相关信息，所有监测数据会同步储存于“他她蜜”云端服务器中，用户可通过用户名和密码，适时调取。</view></br>
			
		<view>	2. 用户可浏览、学习“他她蜜”平台提供的各类健质资讯。</view></br>
			
		<view>	3. 用户可以与同为注册用户的人员互相加为好友，进行包括文字、图片、语音留言及直接的音频、视频等形式的IM即时交流。</view></br>
			
		<view>	4. 用户可以邀请同为注册用户的亲属等加入家庭组，获得相应授权后可以互相浏览对方监测数据等信息。</view></br>
			
		<view>	5. 用户可通过“他她蜜”平台参与各种线上咨询以及线下活动。可按有关活动规则获得相应的积分奖励。</view></br>
			
		<view>	6. 用户在“他她蜜”获得的积分可根据有关规则兑换为相应优惠。</view></br>
			
		<view>	7. 用户可通过“他她蜜”平台向在线的医务等专业人员等请求免费或收费的咨询、签约等服务。</view></br>
			
		<view>	8. 用户在使用收费的咨询、签约服务时，如果账户余额小于需要支付的咨询、签约费用时，需要充值后才可成功发起咨询、签约请求。用户的账户余额可按照“他她蜜”平台提供的方式进行充值或提现。</view></br>
			
		<view>	9. 用户自行选择“他她蜜”平台提供的服务类别、注册的医务等专业人员;平台注册的专业人员有权接受或拒绝相应请求;用户发起的服务请求被平台注册的专业人员接受时，应同时确认用户，专业人员、平台的三方协议，以明确各方的相应的权利和义务</view></br>
			
		<view>	10. “他她蜜”有权通过邮件、在线留言、在线音视频、短信、电话等形式，向注册用户发送提醒信息、促销活动等告知信息的权利。他她蜜公司有权决定将本软件作商业用途，包括但不限于开发、使用本软件的部分服务为第三方作推广等。他她蜜公司承诺在推广过程中严格按照本协议约定保护用户的个人信息，用户可以根据系统设置选择屏蔽、拒绝接收相关推广信息。</view></br>
			
		<view>	11. “他她蜜”在用户开启终端设备具有的定位功能并使用本软件上基于位置信息而提供的服务时，本软件将通过GPS等方式收集用户的地理位置信息。用户可以通过关闭定位功能等停止该项服务。</view></br>
			
		<view>	12. “他她蜜”平台对涉及用户实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的,将采用各种安全技术和程序予以保护，以免遭受未经授权的访问、使用或被露;除非得到用户的授权或法律另有规定，不会向外界披露用户隐私信息。</view></br>
			
		<view>	13. “他她蜜”有权使用用户的注册信息、用户名、密码等信息，登陆进入用户的注册账户，进行证据保全等操作，包括但不限于公证、见证等。</view></br>
			
		<view>	14. “他她蜜”保留在中华人民共和国大陆地区法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。“他她蜜”有权对用户的注册数据及咨询的行为等进行查阅，发现注册数据或咨询行为中存在任何问题或怀疑，均有权向用户发出</view></br>
		</view>
	</view>
</template>

<script>
export default {
	data() {
		return {
			type:1000,
			title:"用户协议"
		};
	},
	//第一次加载
	onLoad(e) {
		if(e.type){
			this.type = parseInt(e.type);
			let title;
			switch (this.type) {
				case 1000:
					title = "登录注册用户协议";
					break;
			}
			this.title = title;
		}
		this.pageData();
	},
	//页面显示
	onShow() {},
	//方法
	methods: {
		pageData() {
			this.$http
				.get('api/common/v1/protocol', {
					type: this.type
				})
				.then(res => {
					this.$refs.article.setContent(res);
				});
		}
	},
	//页面隐藏
	onHide() {},
	//页面卸载
	onUnload() {},
	//页面下来刷新
	onPullDownRefresh() {},
	//页面上拉触底
	onReachBottom() {},
	//用户点击分享
	onShareAppMessage(e) {
		return this.wxShare();
	}
};
</script>
<style lang="scss" scoped>
@import '@/style/mixin.scss';
.protocol_page {
	background-color: #fff;
	padding: 30upx;
	font-size: 30upx;
	line-height: 180%;
	.title {
		font-size: 50upx;
		padding-bottom: 30upx;
	}
}
</style>
